function [ y ] = dwtrec( c,l,h,g )
% dwtrec : 小波重构
% c ------ 小波系数
% l ------ 小波结构
% h ------ 小波重构低通滤波器系数
% g ------ 小波重构高通滤波器系数


cA = c(1:l(1));                     % 最低一层近似系数
N = length(l)-2;                    % 小波分解层数
for i = 1:N
    ra = upsel(cA);                 % 上抽样，偶序列填充，奇序列填零
    ra = symconv(ra,h);             % 重构低频卷积
    ra = midsel(ra,l(i+2));         % 取卷积后的中间部分值，舍弃首末端部分值，使当前近似系数与细节系数长度一致
    st = sum(l(1:i))+1;             % 细节系数起始下标索引
    ed = st+l(i+1)-1;               % 细节系数结束下标索引
    cD = c(st:ed);                  % 细节系数
    rb = upsel(cD);                 % 偶序列填充，奇序列填零
    rb = symconv(rb,g);             % 重构高频卷积
    rb = midsel(rb,l(i+2));         % 取卷积后的中间部分值，舍弃首末端部分值，使当前近似系数与细节系数长度一致
    cA = ra+rb;                     % 近似系数和细节系数相加为本层重构输出,进入下一层重构
end
y = cA;                             % 小波重构输出


end

